In [3]:
import pandas as pd
import sklearn
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import MultiLabelBinarizer

In [4]:
df = pd.read_csv('/home/antoine/mlops_reco_movies/airflow/data/raw/bronze/links.csv')
df.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [5]:
# Affichage des valeurs nulles
print("Missing values in each column:")
print(df.isnull().sum())

Missing values in each column:
movieId      0
imdbId       0
tmdbId     252
dtype: int64

In [6]:
df.dtypes

movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

In [7]:
df = df.astype({"movieId": "int32"}).rename(columns={"movieId": "movie_id", "tmdbId": "tmdb_id", "imdbId": "imdb_id"})
df["tmdb_id"] = df["tmdb_id"].fillna(0).astype("int64")
df["imdb_id"] = "tt" + df["imdb_id"].astype(str).str.lstrip("tt").str.zfill(7)
df.head()

   movie_id    imdb_id  tmdb_id
0         1  tt0114709      862
1         2  tt0113497     8844
2         3  tt0113228    15602
3         4  tt0114885    31357
4         5  tt0113041    11862

In [8]:
# Affichage des valeurs nulles
print("Missing values in each column:")
print(df.isnull().sum())

Missing values in each column:
movie_id    0
imdb_id     0
tmdb_id     0
dtype: int64